note/drawio/converted/dot/260518-sv-cpu-sum-1to10-55.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_7zgxCeO7lLHFsRtG4hqR_1" [label="out[7:0]"];
  "n_7zgxCeO7lLHFsRtG4hqR_10" [label="dedicated_cpu_vif"];
  "n_7zgxCeO7lLHFsRtG4hqR_12" [label="dedicated_cpu_if"];
  "n_7zgxCeO7lLHFsRtG4hqR_14" [label="monitor"];
  "n_7zgxCeO7lLHFsRtG4hqR_15" [label="transaction"];
  "n_7zgxCeO7lLHFsRtG4hqR_17" [label="event_gen_next"];
  "n_7zgxCeO7lLHFsRtG4hqR_18" [label="scoreboard"];
  "n_7zgxCeO7lLHFsRtG4hqR_19" [label="transaction"];
  "n_7zgxCeO7lLHFsRtG4hqR_21" [label="mailbox"];
  "n_7zgxCeO7lLHFsRtG4hqR_24" [label="event_drv_ready"];
  "n_7zgxCeO7lLHFsRtG4hqR_25" [label="dut"];
  "n_7zgxCeO7lLHFsRtG4hqR_3" [label="Dedicated CPU"];
  "n_7zgxCeO7lLHFsRtG4hqR_4" [label="generator"];
  "n_7zgxCeO7lLHFsRtG4hqR_6" [label="transaction"];
  "n_7zgxCeO7lLHFsRtG4hqR_8" [label="mailbox"];
  "n_7zgxCeO7lLHFsRtG4hqR_9" [label="driver"];
  "n__AtSrzDVrfFM_dhdxfO6_105" [label="count_is_last"];
  "n__AtSrzDVrfFM_dhdxfO6_112" [label="clk"];
  "n__AtSrzDVrfFM_dhdxfO6_114" [label="rst"];
  "n__AtSrzDVrfFM_dhdxfO6_173" [label="node_O6-173"];
  "n__AtSrzDVrfFM_dhdxfO6_174" [label="node_O6-174"];
  "n__AtSrzDVrfFM_dhdxfO6_175" [label="node_O6-175"];
  "n__AtSrzDVrfFM_dhdxfO6_176" [label="a_src_sel"];
  "n__AtSrzDVrfFM_dhdxfO6_177" [label="sum_src_cel"];
  "n__AtSrzDVrfFM_dhdxfO6_178" [label="a_reg_load"];
  "n__AtSrzDVrfFM_dhdxfO6_179" [label="sum_reg_load"];
  "n__AtSrzDVrfFM_dhdxfO6_180" [label="out_reg_load"];
  "n__AtSrzDVrfFM_dhdxfO6_181" [label="alu_src_sel"];
  "n__AtSrzDVrfFM_dhdxfO6_182" [label="node_O6-182"];
  "n__AtSrzDVrfFM_dhdxfO6_183" [label="S0"];
  "n__AtSrzDVrfFM_dhdxfO6_184" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_185" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_186" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_187" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_188" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_189" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_190" [label="node_O6-190"];
  "n__AtSrzDVrfFM_dhdxfO6_191" [label="S1"];
  "n__AtSrzDVrfFM_dhdxfO6_192" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_193" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_194" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_195" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_196" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_197" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_198" [label="node_O6-198"];
  "n__AtSrzDVrfFM_dhdxfO6_199" [label="S2"];
  "n__AtSrzDVrfFM_dhdxfO6_200" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_201" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_202" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_203" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_204" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_205" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_206" [label="node_O6-206"];
  "n__AtSrzDVrfFM_dhdxfO6_207" [label="S5"];
  "n__AtSrzDVrfFM_dhdxfO6_208" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_209" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_210" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_211" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_212" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_213" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_214" [label="node_O6-214"];
  "n__AtSrzDVrfFM_dhdxfO6_215" [label="S3"];
  "n__AtSrzDVrfFM_dhdxfO6_216" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_217" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_218" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_219" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_220" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_221" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_223" [label="node_O6-223"];
  "n__AtSrzDVrfFM_dhdxfO6_224" [label="S4"];
  "n__AtSrzDVrfFM_dhdxfO6_225" [label="X"];
  "n__AtSrzDVrfFM_dhdxfO6_226" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_227" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_228" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_229" [label="0"];
  "n__AtSrzDVrfFM_dhdxfO6_230" [label="1"];
  "n__AtSrzDVrfFM_dhdxfO6_232" [label="앞으로는 아래와 같이 Trues Table로 미리 값을 정의해놔야함."];
  "n__AtSrzDVrfFM_dhdxfO6_84" [label="cpu_sum_1to10_55"];
  "n__AtSrzDVrfFM_dhdxfO6_85" [label="datapath"];
  "n__AtSrzDVrfFM_dhdxfO6_87" [label="control_unit"];
  "n__AtSrzDVrfFM_dhdxfO6_88" [label="data storage"];
  "n_7zgxCeO7lLHFsRtG4hqR_4" -> "n_7zgxCeO7lLHFsRtG4hqR_8";
  "n_7zgxCeO7lLHFsRtG4hqR_8" -> "n_7zgxCeO7lLHFsRtG4hqR_9";
  "n_7zgxCeO7lLHFsRtG4hqR_12" -> "n_7zgxCeO7lLHFsRtG4hqR_25";
  "n_7zgxCeO7lLHFsRtG4hqR_14" -> "n_7zgxCeO7lLHFsRtG4hqR_21";
  "n_7zgxCeO7lLHFsRtG4hqR_18" -> "n_7zgxCeO7lLHFsRtG4hqR_4";
  "n_7zgxCeO7lLHFsRtG4hqR_21" -> "n_7zgxCeO7lLHFsRtG4hqR_18";
}
